Revit 2024 API
GeometryObject.Equality Operator
Determines whether two GeometryObjects are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool operator ==(
	GeometryObject first,
	GeometryObject second
)
Visual Basic
Public Shared Operator = ( _
	first As GeometryObject, _
	second As GeometryObject _
) As Boolean
Visual C++
public:
static bool operator ==(
	GeometryObject^ first,
	GeometryObject^ second
)
Parameters
first
Type: Autodesk.Revit.DB.GeometryObject
The first GeometryObject.
second
Type: Autodesk.Revit.DB.GeometryObject
The second GeometryObject.
Return Value
True if the GeometryObjects are the same; otherwise, false.
Remarks
This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
See Also
GeometryObject Class
Autodesk.Revit.DB Namespace